---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.LooseDimensionFailures.LooseInsertsForCurtainWall
source: html/5f269130-1201-c670-5762-452762dbaf85.htm
---
# Autodesk.Revit.DB.BuiltInFailures.LooseDimensionFailures.LooseInsertsForCurtainWall Property

Switching element type to Curtain element. All inserts in the element will be deleted.

## Syntax (C#)
```csharp
public static FailureDefinitionId LooseInsertsForCurtainWall { get; }
```